aboutES/thePomFuckMe24h.org
#+TITLE: maven构建es java工程
* 概述
折腾了几天ES的Java API，中间最为周折的就时maven打包jar时出的问题，各种查问题，各种查不到，整整折腾了我24小时，最后看了看官方文档，日了狗了，居然那么简单。

* 开发环境
| 软件          | 版本                                          |
|---------------+-----------------------------------------------|
| 操作系统      | Mac OS X EI Capitan                           |
|---------------+-----------------------------------------------|
| JDK           | 1.8.0_91                                      |
|---------------+-----------------------------------------------|
| eclipse       | clipse-java-mars-2-macosx-cocoa-x86_64.tar.gz |
|---------------+-----------------------------------------------|
| ElasticSearch | 2.3.1                                         |

* 创建工程
打开eclipse，创建一个Maven Project，采用maven-archetype-quickstart 1.1作为模版。

创建好工程后修改两个地方：
1. Java Build Path中的JRE选为1.8的
2. Java Compiler中的Compiler compliance level:选为1.8（不然override都会警告）

