aboutES/thePomFuckMe24h.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>maven构建es java工程</title>
<!-- 2016-04-27 Wed 10:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="赵光建" />
</head>
<body>
<div id="content">
<h1 class="title">maven构建es java工程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. 开发环境</a></li>
<li><a href="#sec-3">3. 创建工程</a></li>
<li><a href="#sec-4">4. pom.xml</a></li>
<li><a href="#sec-5">5. 代码例子</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
折腾了几天ES的Java API，中间最为周折的就时maven打包jar时出的问题，各种查问题，各种查不到，整整折腾了我24小时，最后看了看官方文档，日了狗了，居然那么简单。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 开发环境</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">软件</th>
<th scope="col" class="left">版本</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">操作系统</td>
<td class="left">Mac OS X EI Capitan</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">JDK</td>
<td class="left">1.8.0<sub>91</sub></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">eclipse</td>
<td class="left">clipse-java-mars-2-macosx-cocoa-x86<sub>64</sub>.tar.gz</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">ElasticSearch</td>
<td class="left">2.3.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 创建工程</h2>
<div class="outline-text-2" id="text-3">
<p>
打开eclipse，创建一个Maven Project，采用maven-archetype-quickstart 1.1作为模版。
</p>

<p>
创建好工程后修改两个地方：
</p>
<ol class="org-ol">
<li>Java Build Path中的JRE选为1.8的
</li>
<li>Java Compiler中的Compiler compliance level:选为1.8（不然override都会警告）
</li>
</ol>
</div>
</div>
