aboutES/thePomFuckMe24h.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 代码例子</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
package com.qzt360.es;

import java.net.InetAddress;
import java.net.UnknownHostException;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.concurrent.TimeUnit;
import java.util.concurrent.locks.Lock;
import java.util.concurrent.locks.ReentrantLock;

import org.apache.log4j.Logger;
import org.elasticsearch.action.admin.indices.template.put.PutIndexTemplateRequest;
import org.elasticsearch.action.bulk.BulkProcessor;
import org.elasticsearch.action.bulk.BulkRequest;
import org.elasticsearch.action.bulk.BulkRequestBuilder;
import org.elasticsearch.action.bulk.BulkResponse;
import org.elasticsearch.action.delete.DeleteResponse;
import org.elasticsearch.action.get.GetResponse;
import org.elasticsearch.action.get.MultiGetItemResponse;
import org.elasticsearch.action.get.MultiGetResponse;
import org.elasticsearch.action.index.IndexRequest;
import org.elasticsearch.action.search.SearchResponse;
import org.elasticsearch.action.search.SearchType;
import org.elasticsearch.action.update.UpdateRequest;
import org.elasticsearch.action.update.UpdateResponse;
import org.elasticsearch.client.Client;
import org.elasticsearch.client.IndicesAdminClient;
import org.elasticsearch.client.transport.TransportClient;
import org.elasticsearch.common.collect.MapBuilder;
import org.elasticsearch.common.settings.Settings;
import org.elasticsearch.common.transport.InetSocketTransportAddress;
import org.elasticsearch.common.unit.ByteSizeUnit;
import org.elasticsearch.common.unit.ByteSizeValue;
import org.elasticsearch.common.unit.TimeValue;
import org.elasticsearch.index.query.QueryBuilder;
import org.elasticsearch.index.query.QueryBuilders;
import org.elasticsearch.index.query.WildcardQueryBuilder;
import org.elasticsearch.search.SearchHit;
import org.elasticsearch.search.SearchHits;

public class ESManager {
	private String strClusterName;
	private String strTransportHostName;
	private int nConcurrentRequests = 8;// 貌似是单机cpu核心数时速度最佳
	private Logger logger = Logger.getLogger(ESManager.class);

	public Client client = null;
	public BulkProcessor bulkProcessor = null;

	public ESManager() {
		super();
	}

	public ESManager(String strClusterName, String strTransportHostName) {
		super();
		this.strClusterName = strClusterName;
		this.strTransportHostName = strTransportHostName;
	}

	public ESManager(String strClusterName, String strTransportHostName, int nConcurrentRequests) {
		super();
		this.strClusterName = strClusterName;
		this.strTransportHostName = strTransportHostName;
		this.nConcurrentRequests = nConcurrentRequests;
	}

	public static void main(String[] args) {

		// 批量入库
		// client.prepareIndex("index_01", "type_01").get();
		// for (int i = 0; i &lt; 10; i++) {
		// Map&lt;String, Object&gt; json = new HashMap&lt;String, Object&gt;();
		// json.put("title", "user" + i);
		// json.put("date_create", new Date());
		// json.put("context", "trying out Elasticsearch" + i);
		// // update(json, strIndex, strType, "im_20160303_0");
		// bulkProcessor.add(new IndexRequest(strIndex, strType, "id_" +
		// i).source(json));
		// }
		// 查询
		// QueryBuilder qb1 = QueryBuilders.termQuery("user", "user8");
		// QueryBuilder qb2 = QueryBuilders.matchQuery("user", "user8");
		// // QueryBuilder qb2 = QueryBuilders.fil
		// QueryBuilder qb3 =
		// QueryBuilders.boolQuery().must(QueryBuilders.termQuery("user",
		// "user1"));
		// // .must(QueryBuilders.termQuery("user", "user2"));
		// // .mustNot(QueryBuilders.termQuery("user", "user3"))
		// // .mustNot(QueryBuilders.termQuery("user",
		// // "user4")).should(QueryBuilders.termQuery("user", "user5"));
		// QueryBuilder qb4 = QueryBuilders.filteredQuery(qb1,
		// QueryBuilders.rangeQuery("age").from(20).to(30).includeLower(true).includeUpper(false));
		//
		// WildcardQueryBuilder wqb = new WildcardQueryBuilder("user", "*ser*");
		// QueryBuilder qb5 = QueryBuilders.boolQuery().should(wqb);
		// QueryBuilder qb6 = QueryBuilders.boolQuery().must(wqb);
		// SearchResponse response =
		// client.prepareSearch(strIndex).setTypes(strType)
		// .setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(qb6).setFrom(0).setSize(100).setExplain(true)
		// .execute().actionGet();
		//
		// for (SearchHit hit : response.getHits()) {
		// Map&lt;String, Object&gt; source = hit.getSource();
		// // logger.info("user: " + source.get("user"));
		// logger.info("source: " + source.toString());
		// }
		// WildcardQueryBuilder wqb = new WildcardQueryBuilder("title", "*se*");
		// QueryBuilder qb = QueryBuilders.boolQuery().should(wqb);
		// SearchResponse response =
		// client.prepareSearch(strIndex).setTypes(strType)
		// .setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(qb).setFrom(0).setSize(100).setExplain(true)
		// .execute().actionGet();
		//
		// for (SearchHit hit : response.getHits()) {
		// Map&lt;String, Object&gt; source = hit.getSource();
		// // logger.info("user: " + source.get("user"));
		// logger.info("source: " + source.toString());
		// }
		// cleanup();
	}

	private void admin(IndicesAdminClient iac) {
		// 定义IM数据模版
		PutIndexTemplateRequest pitr = new PutIndexTemplateRequest("im").template("im*");
		// setting
		// pitr.settings(new MapBuilder&lt;String,
		// Object&gt;().put("number_of_shards", 6).put("number_of_replicas", 1)
		// .put("refresh_interval", "1s").put("merge.policy.floor_segment",
		// "2mb").map());

		Map&lt;String, Object&gt; defaultMapping = new HashMap&lt;String, Object&gt;();
		// 关闭_all
		defaultMapping.put("_all", new MapBuilder&lt;String, Object&gt;().put("enabled", false).map());
		defaultMapping.put("numeric_detection", false);
		defaultMapping.put("dynamic_templates", new Object[] {
				new MapBuilder&lt;String, Object&gt;()
						.put("date_tpl", new MapBuilder&lt;String, Object&gt;().put("match", "date*")
								.put("mapping",
										new MapBuilder&lt;String, Object&gt;().put("type", "date")
												.put("index", "not_analyzed").put("doc_values", true).map())
								.map())
						.map(),
				new MapBuilder&lt;String, Object&gt;()
						.put("all_tpl", new MapBuilder&lt;String, Object&gt;().put("match", "*")
								.put("mapping",
										new MapBuilder&lt;String, Object&gt;().put("type", "{dynamic_type}")
												.put("index", "not_analyzed").put("doc_values", true).map())
								.map())
						.map() });
		pitr.mapping("_default_", defaultMapping);
		iac.putTemplate(pitr);
	}

	private static Lock initLock = new ReentrantLock();

	public void setup() {
		logger.debug("init settings");
		if (client == null) {
			initLock.lock();
			Settings settings;
			if (strClusterName == null) {
				settings = Settings.settingsBuilder().put("cluster.name", "qzt360esmacbookpro")
						.put("client.transport.sniff", true).build();
			} else {
				settings = Settings.settingsBuilder().put("cluster.name", strClusterName)
						.put("client.transport.sniff", true).build();
			}
			try {
				logger.debug("init client");
				if (strTransportHostName == null) {
					client = TransportClient.builder().settings(settings).build().addTransportAddress(
							new InetSocketTransportAddress(InetAddress.getByName("localhost"), 9300));
				} else {
					client = TransportClient.builder().settings(settings).build().addTransportAddress(
							new InetSocketTransportAddress(InetAddress.getByName(strTransportHostName), 9300));
				}
				IndicesAdminClient iac = client.admin().indices();
				admin(iac);
			} catch (UnknownHostException e) {
				logger.error(e);
			} finally {
				initLock.unlock();
			}
		}
		if (bulkProcessor == null) {
			bulkProcessor = BulkProcessor.builder(client, new BulkProcessor.Listener() {
				@Override
				public void beforeBulk(long executionId, BulkRequest request) {
				}

				@Override
				public void afterBulk(long executionId, BulkRequest request, BulkResponse response) {
				}

				@Override
				public void afterBulk(long executionId, BulkRequest request, Throwable failure) {
				}
			}).setBulkActions(5000).setBulkSize(new ByteSizeValue(10, ByteSizeUnit.MB))
					.setFlushInterval(TimeValue.timeValueSeconds(5)).setConcurrentRequests(nConcurrentRequests).build();
		}
	}

	// 删除某个索引
	public void deleteIndex(String strIndex) {
		if (client.admin().indices().prepareExists(strIndex).get().isExists()) {
			client.admin().indices().prepareDelete(strIndex).get();
		}
	}

	// 创建一个空索引，很少用到这种情况
	public void createIndex(String strIndex) {
		if (!client.admin().indices().prepareExists(strIndex).get().isExists()) {
			client.admin().indices().prepareCreate(strIndex).get();
		}
	}

	public void cleanup() {
		logger.debug("bulkProcessor close");
		if (bulkProcessor != null) {
			try {
				bulkProcessor.awaitClose(10, TimeUnit.SECONDS);
			} catch (InterruptedException e) {
				logger.error(e);
			}
		}
		logger.debug("client close");
		if (client != null) {
			client.close();
		}
	}

	// 保存数据，insert 返回ture，update 返回false
	public boolean save(Map&lt;String, Object&gt; json, String strIndex, String strType, String strId) {
		UpdateResponse resp = client.update(new UpdateRequest(strIndex, strType, strId).doc(json).upsert(json))
				.actionGet();
		if (resp.isCreated()) {
			return true;
		} else {
			return false;
		}
	}

	public boolean update(Map&lt;String, Object&gt; json, String index, String type, String id) {

		UpdateResponse resp = client.update(new UpdateRequest(index, type, id).doc(json).upsert(json)).actionGet();
		if (resp.isCreated())
			return true;
		return false;
	}

	public void index(Map&lt;String, Object&gt; json, String strIndex, String strType) {
		// logger.debug("json init");
		// Map&lt;String, Object&gt; json = new HashMap&lt;String, Object&gt;();
		// json.put("user", "kimchy");
		// json.put("postDate", new Date());
		// json.put("message", "trying out Elasticsearch");
		logger.debug("response init");
		// IndexResponse response =
		client.prepareIndex(strIndex, strType).setSource(json).get();

		// logger.debug("index:" + response.getIndex());
		// logger.debug("type:" + response.getType());
		// logger.debug("id:" + response.getId());
		// logger.debug("version:" + response.getVersion());
		// logger.debug("isCreated:" + response.isCreated());
	}

	public void index(Map&lt;String, Object&gt; json, String strIndex, String strType, String strId) {
		// logger.debug("json init");
		// Map&lt;String, Object&gt; json = new HashMap&lt;String, Object&gt;();
		// json.put("user", "kimchy");
		// json.put("postDate", new Date());
		// json.put("message", "trying out Elasticsearch");
		logger.debug("response init");
		// IndexResponse response =
		client.prepareIndex(strIndex, strType, strId).setSource(json).get();
		// logger.debug("index:" + response.getIndex());
		// logger.debug("type:" + response.getType());
		// logger.debug("id:" + response.getId());
		// logger.debug("version:" + response.getVersion());
		// logger.debug("isCreated:" + response.isCreated());
	}

	public void get() {
		logger.debug("GetResponse init");
		GetResponse response = client.prepareGet("twitter", "tweet", "1").get();
		logger.debug("index:" + response.getIndex());
		logger.debug("type:" + response.getType());
		logger.debug("id:" + response.getId());
		logger.debug("version:" + response.getVersion());
	}

	public void delete() {
		logger.debug("DeleteResponse init");
		DeleteResponse response = client.prepareDelete("twitter", "tweet", "1").get();
		logger.debug("index:" + response.getIndex());
		logger.debug("type:" + response.getType());
		logger.debug("id:" + response.getId());
		logger.debug("version:" + response.getVersion());
	}

	public void update() {

	}

	public void search() {
		// SearchResponse response = client.prepareSearch("twitter",
		// "tweet").setTypes("type1", "type2")
		// .setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(QueryBuilders.termQuery("multi",
		// "test")) // Query
		// .setPostFilter(QueryBuilders.rangeQuery("age").from(12).to(18)) //
		// Filter
		// .setFrom(0).setSize(60).setExplain(true).execute().actionGet();
		// MatchAll on the whole cluster with all default options
		// SearchResponse responseAll =
		// client.prepareSearch().execute().actionGet();
		// logger.debug("contextSize:" + responseAll.contextSize());
		// logger.debug("toString:" + responseAll.toString());
		// logger.debug("getContext().size:" + responseAll.getContext().size());
		QueryBuilder qb1 = QueryBuilders.termQuery("strCallerId", "522738778");
		SearchResponse response = client.prepareSearch("im_20160303", "im_20160304").setTypes("im")
				.setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(qb1).setFrom(0).setSize(60).setExplain(true)
				.execute().actionGet();
		SearchHits hits = response.getHits();
		for (int i = 0; i &lt; 60; i++) {
			logger.info("" + hits.getAt(i).getScore());
		}
	}

	public void search(String strNetid) {
		setup();
		WildcardQueryBuilder wqb = new WildcardQueryBuilder("strCallerId", "*" + strNetid + "*");
		QueryBuilder qb = QueryBuilders.boolQuery().should(wqb);
		SearchResponse response = client.prepareSearch("im_20160303").setTypes("im")
				.setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(qb).setFrom(0).setSize(100).setExplain(true)
				.execute().actionGet();

		for (SearchHit hit : response.getHits()) {
			Map&lt;String, Object&gt; source = hit.getSource();
			// logger.info("user: " + source.get("user"));
			logger.info("source: " + source.toString());
		}
		cleanup();
	}

	public void multiGet() {
		MultiGetResponse multiGetItemResponses = client.prepareMultiGet().add("twitter", "tweet", "1")
				.add("twitter", "tweet", "2", "3", "4").add("another", "type", "foo").get();

		for (MultiGetItemResponse itemResponse : multiGetItemResponses) {
			GetResponse response = itemResponse.getResponse();
			if (response.isExists()) {
				String json = response.getSourceAsString();
				logger.debug(json);
			}
		}
	}

	public void bulk(List&lt;Map&lt;String, Object&gt;&gt; listJson, String strIndex, String strType) {
		logger.debug("BulkRequestBuilder init");
		BulkRequestBuilder bulkRequest = client.prepareBulk();
		for (Map&lt;String, Object&gt; json : listJson) {
			bulkRequest.add(client.prepareIndex(strIndex, strType).setSource(json));
		}
		BulkResponse bulkResponse = bulkRequest.get();
		if (bulkResponse.hasFailures()) {
			logger.debug("bulkResponse.hasFailures():true");
		} else {
			logger.debug("bulkResponse.hasFailures():false");
		}
	}

	public void bulkProcessor(List&lt;Map&lt;String, Object&gt;&gt; listJson, String strIndex, String strType) {
		for (Map&lt;String, Object&gt; json : listJson) {
			bulkProcessor.add(new IndexRequest(strIndex, strType).source(json));
		}
	}

	public void bulkProcessor(Map&lt;String, Object&gt; json, String strIndex, String strType) {
		bulkProcessor.add(new IndexRequest(strIndex, strType).source(json));
	}

	public void bulkProcessor(List&lt;Map&lt;String, Object&gt;&gt; listJson, String strIndex, String strType, String strIdKey) {
		for (Map&lt;String, Object&gt; json : listJson) {
			bulkProcessor.add(new IndexRequest(strIndex, strType, (String) json.get(strIdKey)).source(json));
		}
	}

	public static void count() {

	}

	public static void query() {

	}
}
</pre>

<pre class="example">
package com.qzt360.ESWJLog;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileInputStream;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.Date;
import java.util.HashMap;
import java.util.Map;

import org.apache.log4j.Logger;
import org.elasticsearch.action.index.IndexRequest;

public class ImLog2ES {
	private static Logger logger = Logger.getLogger(ImLog2ES.class);

	public static void main(String[] args) {
		logger.debug("ImLog2ES begin");

		ESManager esm = new ESManager("wj-es", "192.168.36.31", Integer.parseInt(args[1]));
		esm.setup();
		File filePath = new File(args[0]);
		File[] aFile = filePath.listFiles();

		long lBegin = System.currentTimeMillis();
		BufferedReader br = null;
		String strLine = null;
		int nRow = 0;
		IMManager im = new IMManager();
		try {
			for (File file : aFile) {
				br = new BufferedReader(new InputStreamReader(new FileInputStream(file.getPath())));
				while ((strLine = br.readLine()) != null) {
					nRow++;
					if (im.isLegal(strLine)) {
						Map&lt;String, Object&gt; json = new HashMap&lt;String, Object&gt;();
						json.put("nCustomerId", im.getnCustomerId());
						json.put("nDeptId", im.getnDeptId());
						json.put("strHostName", im.getStrHostName());
						json.put("strEqpName", im.getStrEqpName());
						json.put("dateTime", new Date((long) im.getnTime() * 1000L));
						json.put("lSip", im.getlSip());
						json.put("strSmac", im.getStrSmac());
						json.put("nApplication", im.getnApplication());
						json.put("nType", im.getnType());
						json.put("lSessionId", im.getlSessionId());
						json.put("strCallerId", im.getStrCallerId());
						json.put("strCalledId", im.getStrCalledId());
						json.put("nDir", im.getnDir());
						json.put("nContentLen", im.getnContentLen());
						json.put("strContent", im.getStrContent());
						json.put("nPartyNum", im.getnPartyNum());
						json.put("strCallerNickname", im.getStrCallerNickname());
						json.put("strCalledNickname", im.getStrCalledNickname());
						json.put("nCertType", im.getnCertType());
						json.put("strCertCode", im.getStrCertCode());
						json.put("strName", im.getStrName());
						json.put("strCountryCode", im.getStrCountryCode());
						esm.bulkProcessor
								.add(new IndexRequest("im", file.getName(), file.getName() + "_" + nRow).source(json));
					}
				}
			}
		} catch (Exception e) {
			logger.error(e);
		} finally {
			if (br != null) {
				try {
					br.close();
				} catch (IOException e) {
					logger.error(e);
				}
			}
		}
		long lEnd = System.currentTimeMillis();
		esm.cleanup();
		logger.info("time: " + (lEnd - lBegin));
		logger.debug("ImLog2ES end");
	}

}
</pre>

<pre class="example">
package com.qzt360.ESWJLog;

import java.util.Map;

import org.apache.log4j.Logger;
import org.elasticsearch.action.search.SearchResponse;
import org.elasticsearch.action.search.SearchType;
import org.elasticsearch.index.query.QueryBuilder;
import org.elasticsearch.index.query.QueryBuilders;
import org.elasticsearch.index.query.WildcardQueryBuilder;
import org.elasticsearch.search.SearchHit;

public class QueryFromImLog {
	private static Logger logger = Logger.getLogger(QueryFromImLog.class);

	public static void main(String[] args) {
		if (args.length != 5) {
			System.out.println("&lt;indexs&gt; &lt;types&gt; &lt;field&gt; &lt;like or notlike&gt; &lt;account&gt;");
			System.exit(5);
		}
		String[] astrIndex = args[0].split(",");
		String[] astrType = args[1].split(",");
		logger.debug("QueryFromImLog begin");
		ESManager esm = new ESManager("wj-es", "192.168.36.31");
		esm.setup();
		long lBegin = System.currentTimeMillis();

		QueryBuilder qb = QueryBuilders.boolQuery().must(QueryBuilders.termQuery(args[2], args[4]));
		if ("like".equals(args[3])) {
			WildcardQueryBuilder wqb = new WildcardQueryBuilder(args[2], "*" + args[4] + "*");
			qb = QueryBuilders.boolQuery().should(wqb);
		}

		SearchResponse response = esm.client.prepareSearch(astrIndex).setTypes(astrType)
				.setSearchType(SearchType.DFS_QUERY_THEN_FETCH).setQuery(qb).setFrom(0).setSize(100).setExplain(true)
				.execute().actionGet();

		for (SearchHit hit : response.getHits()) {
			Map&lt;String, Object&gt; source = hit.getSource();
			logger.info("source: " + source.toString());
		}
		long lEnd = System.currentTimeMillis();
		esm.cleanup();
		logger.info("time: " + (lEnd - lBegin));
		logger.debug("QueryFromImLog end");
	}

}
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 赵光建</p>
<p class="date">Created: 2016-04-27 Wed 10:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
